static class I_letter {
  static String [] num1s;//1文字の場合の文字表示
  static String [][] num2s;//2文字の場合の文字表示
  static String [][] num3s;//3文字の場合のその他以外の文字表示

  static void init_letter() {
    num1s = new String [] {  
      "Q", "あ(A)", "Z", "W", "S", "X", "え(E)", "D", "C", "R", "F", "V", "T", "G", "B", "Y", "H", "ん(N)", "う(U)", "J", "M", "い(I)", "K", "--", "お(O)", "L", "--", "P"
    };
    num2s = new String [][] {
      {      
        "くぁ", "くぃ", "く(くぅ)", "くぇ", "くぉ"
      }//Q
      , {
      }//A
      , {      
        "ざ", "じ", "ず", "ぜ", "ぞ"
      }//Z
      , {      
        "わ", "うぃ", "う", "うぇ", "を"
      }//W
      , {      
        "さ", "し", "す", "せ", "そ"
      }//S
      , {      
        "ぁ", "ぃ", "ぅ", "ぇ", "ぉ"
      }//X
      , {
      }//E
      , {      
        "だ", "ぢ", "づ", "で", "ど"
      }//D
      , {      
        "か", "し", "く", "せ", "こ"
      }//C
      , {      
        "ら", "り", "る", "れ", "ろ"
      }//R
      , {      
        "ふぁ", "ふぃ", "ふ", "ふぇ", "ふぉ"
      }//F
      , {      
        "ヴぁ", "ヴぃ", "ヴ", "ヴぇ", "ヴぉ"
      }//V
      , {      
        "た", "ち", "つ", "て", "と"
      }//T
      , {      
        "が", "ぎ", "ぐ", "げ", "ご"
      }//G
      , {      
        "ば", "び", "ぶ", "べ", "ぼ"
      }//B
      , {      
        "や", "い", "ゆ", "いぇ(え)", "よ"
      }//Y
      , {      
        "は", "ひ", "ふ", "へ", "ほ"
      }//H
      , {      
        "な", "に", "ぬ", "ね", "の"
      }//N
      , {
      }//U
      , {      
        "じゃ", "じ(じぃ)", "じゅ", "じぇ", "じょ"
      }//J
      , {      
        "ま", "み", "む", "め", "も"
      }//M
      , {
      }//I
      , {      
        "か", "き", "く", "け", "こ"
      }//K
      , {
      }//なし
      , {
      }//O
      , {      
        "ぁ", "ぃ", "ぅ", "ぇ", "ぉ"
      }//L
      , {
      }//なし
      , {      
        "ぱ", "ぴ", "ぷ", "ぺ", "ぽ"
      }//P
      , {
      }//なし
      , {
      }//なし
    };
    num3s = new String [][] {
      {
        "くゃ", "くぃ","くゅ","くぇ", "くょ"
      }//Q
      , {
      }//A
      , {
        "じゃ","じぃ", "じゅ","じぇ", "じょ"
      }//Z
      , {
      }//W
      , {
        "しゃ", "しぃ","しゅ","しぇ", "しょ"
      }//S
      , {
        "ゃ", "ぃ","ゅ", "ぇ","ょ"
      }//X
      , {
      }//E
      , {
        "ぢゃ","ぢぃ", "ぢゅ", "ぢぇ","ぢょ"
      }//D
      , {
        "ちゃ","ちぃ", "ちゅ", "ちぇ","ちょ"
      }//C
      , {
        "りゃ","りぃ", "りゅ","りぇ", "りょ"
      }//R
      , {
        "ふゃ","ふぃ", "ふゅ","ふぇ", "ふょ"
      }//F
      , {
        "ヴゃ","ヴぃ", "ヴゅ","ヴぇ", "ヴょ"
      }//V
      , {
        "ちゃ", "ちぃ","ちゅ","ちぇ", "ちょ"
      }//T
      , {
        "ぎゃ","ぎぃ", "ぎゅ","ぎぇ", "ぎょ"
      }//G
      , {
        "びゃ","びぃ", "びゅ","びぇ", "びょ"
      }//B
      , {
      }//Y
      , {
        "ひゃ","ひぃ", "ひゅ","ひぇ", "ひょ"
      }//H
      , {
        "にゃ","にぃ", "にゅ","にぇ", "にょ"
      }//N
      , {
      }//U
      , {
        "じゃ", "じぃ","じゅ","じぇ", "じょ"
      }//J
      , {
        "みゃ", "みぃ","みゅ","みぇ", "みょ"
      }//M
      , {
      }//I
      , {
        "きゃ","きぃ", "きゅ","きぇ", "きょ"
      }//K
      , {
      }//なし
      , {
      }//O
      , {
        "ゃ", "ぃ","ゅ", "ぇ","ょ"
      }//L
      , {
      }//なし
      , {
        "ぴゃ","ぴぃ", "ぴゅ","ぴぇ", "ぴょ"
      }//P
      , {
      }//なし
      , {
      }//なし
    };
  }
}
